
# 西瓜书，表4.1西瓜数据集2.0
data_list = [
    ['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 'Y'],
    ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 'Y'],
    ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 'Y'],
    ['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', 'Y'],
    ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', 'Y'],
    ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 'Y'],
    ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘', 'Y'],
    ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑', 'Y'],
    ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑', 'N'],
    ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘', 'N'],
    ['浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑', 'N'],
    ['浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘', 'N'],
    ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑', 'N'],
    ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑', 'N'],
    ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘', 'N'],
    ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑', 'N'],
    ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑', 'N']
]
feature = ['色泽', '根蒂', '敲声', '纹理', '脐部', '触感', '好瓜']


if __name__ == '__main__':
    from module1 import *

    Tree = tree_generate(data_list)

    print(Tree)
# {'模糊': 'N',
#  '清晰': {'稍蜷':
#               {'乌黑': {'硬滑': 'Y',
#                         '软粘': 'N'},
#                '青绿': 'Y'},
#           '硬挺': 'N',
#           '蜷缩': 'Y'},
#  '稍糊': {'硬滑': 'N',
#           '软粘': 'Y'}}
